Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
The TeklaStructuresDrawingsApplicationException class defines the base class for all exceptions
that can be thrown while using Tekla.Structures.Drawing.

Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException.#ctor
Creates a new exception instance.

Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException.#ctor(System.String)
Creates a new exception instance.
Message: The exception message.

Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.